; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-10)
(:domain gripper-strips)
(:objects rooma roomb room3 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room3)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 4 of 10
2. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 4 of 10
3. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 5 of 10
4. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 5 of 10
5. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 5 of 10
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 10
7. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 6 of 10
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 10
9. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 6 of 10
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 10
11. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 7 of 10
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 10
13. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 7 of 10
14. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 10
15. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 8 of 10
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 10
17. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 8 of 10
18. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 10
19. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 9 of 10
20. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 9 of 10
21. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 9 of 10
22. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 9 of 10
23. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 9 of 10
24. (drop ball10 room3 left)
   deleted: (carry ball10 left)
   added: (at ball10 room3) (free left)
   goals met: 10 of 10
